[
  {
    "no": 1,
    "projectCode": "turnonyournote",
    "periodStart": "2020-06-13T00:00:00.000Z",
    "periodEnd": "2020-07-04T00:00:00.000Z",
    "skills": "Android Studio, Java, XML, SQLite",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "켜는 것은 메모장",
        "detail": "안드로이드 앱 개발을 처음 접하고 만들어본 앱입니다.\n'켜자마자영단어' 라는 앱으로 스마트폰을 켰을때 주요 영단어를 외우게 유도하는 앱에서 영감을 받았는데, 이 앱은 내가 외우고 싶은 모든 키워드들을 저장할 수 있도록 기획을 했습니다."
      },
      {
        "language": "en",
        "title": "Turning on Notepad",
        "detail": "This is the first Android app I created as I began learning app development. Inspired by the 'Vocabulary Upon Power-on' app, which encourages users to memorize important English words when they turn on their smartphone, I designed this app to allow users to save any keywords they want to remember."
      },
      {
        "language": "jp",
        "title": "メモ帳をオンにする",
        "detail": "Androidアプリの開発に初めて取り組み、作成したアプリです。スマートフォンを起動する際に重要な単語を覚えることを促す『起動時英単語』アプリからインスピレーションを受けて、このアプリはユーザーが覚えたいすべてのキーワードを保存できるように企画しました。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "turnonyournote_1.png"
      }
    ]
  },
  {
    "no": 2,
    "projectCode": "gogoroutine",
    "periodStart": "2020-08-09",
    "periodEnd": "2020-10-03",
    "skills": "Android Studio, Java, XML, SQLite",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "고고루틴",
        "detail": "처음에는 우리가 습관을 만들지만, 그 다음에는 습관이 우리를 만든다.\n항상 휴대하고 있는 스마트폰이 좋은 습관을 갖추도록 도움을 주면 어떨까? 라는 생각에서 비롯되어 기획하고 개발한 앱입니다.\nPlayStore에 출시까지 하여 다양한 피드백도 반영해보며 앱을 개선시켰습니다.(현재는 업데이트 반려로 내려감)"
      },
      {
        "language": "en",
        "title": "GoGoRoutine",
        "detail": "At first, we create our habits, but then our habits create us.\nInspired by the idea of having our smartphones, which we always carry, help us build good habits, I planned and developed this app.\nI launched it on the Play Store, received various feedback, and improved the app based on that feedback."
      },
      {
        "language": "jp",
        "title": "ゴー・ゴー・ルーチン",
        "detail": "最初は私たちが習慣を作りますが、その後は習慣が私たちを作ります\n常に持ち歩くスマートフォンが良い習慣を身につける手助けをしてくれたらどうだろうか？という考えから企画し、開発したアプリです。Playストアでリリースし、様々なフィードバックを反映させてアプリを改善しました。（現在はアップデート拒否により配信停止中）"
      }

    ],
    "attachments": [
      {
        "originalFilename": "gogoroutine_1.png"
      }
    ]
  },
  {
    "no": 3,
    "projectCode": "diadoo",
    "periodStart": "2020-09-13",
    "periodEnd": "2020-12-05",
    "skills": ".Net, C#, MSSQL",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "Diadoo",
        "detail": "저의 졸업작품인 캘린더 프로그램입니다.\n팀원들과 협업을 하며 일정을 맞추는데 쓸 수 있는 협업툴이 필요하였고, 직접 이를 구현하자 생각하고 만들게 된 프로그램입니다."
      },
      {
        "language": "en",
        "title": "Diadoo",
        "detail": "This is my graduation project, a calendar program. Our team needed a collaboration tool to help manage and align schedules effectively, so we decided to develop this program ourselves."
      },
      {
        "language": "jp",
        "title": "Diadoo",
        "detail": "卒業制作として作成したカレンダープログラムです。チームメンバーと協力してスケジュールを調整するために、コラボレーションツールが必要でした。そのため、自分たちで実装しようと考えて作成したプログラムです。"
      }


    ],
    "attachments": [
      {
        "originalFilename": "diadoo_1.png"
      }
    ]
  },
  {
    "no": 4,
    "projectCode": "meting",
    "periodStart": "2021-02-13",
    "periodEnd": "2021-02-18",
    "skills": "Flutter, Firebase",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "MeTing",
        "detail": "스마트폰을 아이폰으로 바꾸면서 크로스플랫폼의 필요성을 느꼈고, 플러터의 매력에 빠져 21년 초에 학습을 시작했습니다.\n스토어에 출시한 첫 플러터 프로젝트로, 비록 프로토타입 단계의 앱이었지만, 회의실에 QR 코드를 배치하여 사용 중인 회의실을 Firebase를 통해 실시간으로 공유할 수 있는 앱을 개발했습니다.\n덕분에 아이디어 실현의 장벽을 크게 낮출 수 있었습니다."
      },
      {
        "language": "en",
        "title": "MeTing",
        "detail": "When I switched my smartphone to an iPhone, I realized the need for cross-platform solutions and became fascinated with Flutter.\nStarting in early 2021, I created my first Flutter project and released it on the store.\nAlthough it was a prototype, this app enabled real-time sharing of occupied meeting rooms by placing QR codes in the rooms and using Firebase. This experience greatly lowered the barrier to bringing my ideas to life."
      },
      {
        "language": "jp",
        "title": "MeTing",
        "detail": "スマートフォンをiPhoneに変更したことで、クロスプラットフォームの必要性を感じ、Flutterの魅力に惹かれました。\n2021年初めから学習を始め、ストアにリリースした最初のFlutterプロジェクトです。\nプロトタイプ段階のアプリでしたが、会議室にQRコードを配置し、Firebaseを使って使用中の会議室をリアルタイムで共有できるアプリを開発しました。\nこれにより、アイデア実現の壁を大きく下げることができました。"
      }

    ],
    "attachments": [
      {
        "originalFilename": "meting_1.png"
      }
    ]
  },
  {
    "no": 5,
    "projectCode": "kat",
    "periodStart": "2021-05-13",
    "periodEnd": "2022-08-07",
    "skills": "Flutter, SQFLite",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "ADHD 검사 시스템",
        "detail": "장기간 맡아 진행한 플러터 프로젝트입니다.\n주로 소아 또는 청소년을 대상으로 ADHD 검사를 수행하는 앱으로, 내담자 관리, 5가지 검사 시행, 검사별 보고서 출력, 라이선스 기능, 데이터 백업, 오류 로깅, 자동 업데이트 배포 등의 기능을 탑재하여 출시했습니다.\n출시 후 200여 개의 기관에 판매 성과를 이루었으며, 지속적으로 피드백을 반영하고 기능을 개선하고 있습니다."
      },
      {
        "language": "en",
        "title": "ADHD Testing System",
        "detail": "This is a long-term Flutter project.\nThe app is primarily designed for conducting ADHD assessments for children and adolescents, featuring client management, five types of assessments, report generation for each test, licensing, data backup, error logging, and automatic update deployment.\nSince its launch, it has achieved sales in over 200 institutions, and ongoing feedback and functionality improvements have been implemented."
      },
      {
        "language": "jp",
        "title": "ADHD検査システム",
        "detail": "長期間担当しているFlutterプロジェクトです。\n主に小児または青少年を対象としたADHD検査を実施するためのアプリで、クライアント管理、5種類の検査実施、検査別レポート出力、ライセンス機能、データバックアップ、エラーロギング、自動更新配信などの機能を備えてリリースしました。\nリリース後、200以上の機関に販売され、継続的なフィードバック反映と機能改善を行っています。"
      }

    ],
    "attachments": [
      {
        "originalFilename": "kat_1.png"
      }
    ]
  },
  {
    "no": 6,
    "projectCode": "pretestmanager",
    "periodStart": "2021-09-22",
    "periodEnd": "2021-10-03",
    "skills": "Flutter, ExpressJS, MySQL",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "모의고사 감독관 앱",
        "detail": "사내에서 운영 중인 서비스 중 간호대학생을 위한 온라인 모의고사 플랫폼이 있습니다.\n보통 학생들을 중심으로 모의고사가 진행되지만, 교수님이나 조교들이 실시간으로 학생들의 응시 상태와 정보를 관리하고 싶다는 요청이 많았습니다.\n이에 따라 Flutter Web 형태로 제작하여, 진행 상황 확인, 학생 정보 수정 등의 기능을 갖춘 프로젝트를 배포했습니다."
      },
      {
        "language": "en",
        "title": "Exam Supervisor App",
        "detail": "Within our company, we operate an online mock exam platform for nursing students.\nTypically, the platform is student-focused, but we frequently received requests from supervisors, such as professors and teaching assistants, to manage student participation status and information in real-time.\nIn response, I developed and deployed a Flutter Web-based project that includes features for tracking progress, editing student information, and more."
      },
      {
        "language": "jp",
        "title": "模擬試験監督アプリ",
        "detail": "社内で運営中のサービスの一つに、看護学生向けのオンライン模擬試験プラットフォームがあります。\n通常は学生主体で模擬試験が行われますが、教授や助手から、学生の受験状況や情報をリアルタイムで管理したいという要望が多く寄せられていました。\nこれに応えて、Flutter Web形式で進行状況の確認や学生情報の修正などの機能を搭載したプロジェクトを展開しました。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "pretest_manager_1.png"
      }
    ]
  },
  {
    "no": 7,
    "projectCode": "bottari",
    "periodStart": "2022-03-13",
    "periodEnd": "2022-05-25",
    "skills": "Flutter, Firebase",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "보따리",
        "detail": "플레이스토어에 세 번째로 배포한 플러터 프로젝트입니다.\n예전에 인상 깊게 사용했던 앱 중 하나가 익명으로 서로 하고 싶었던 이야기를 편하게 나눌 수 있는 앱이었는데, 그 앱에서 영감을 받아 개발하게 되었습니다.\n옛날에 할머니가 들려주시던 이야기 보따리의 추억을 담아 '보따리'라는 이름을 붙였으며, 누구나 이야기꾼이 될 수 있는 플랫폼을 만들고자 했습니다.\n현재 플레이스토어에서 다운로드할 수 있으며, 사용자들의 적극적인 피드백을 받고 있습니다."
      },
      {
        "language": "en",
        "title": "Bottari",
        "detail": "This is my third Flutter project released on the Play Store.\nInspired by an app I used a while ago, where people could comfortably share their thoughts anonymously, I developed 'Bottari,' a name reminiscent of the storytelling bundle my grandmother used to share tales from.\nThe goal is to create a platform where anyone can become a storyteller.\nIt is currently available on the Play Store, and I am actively collecting user feedback to improve it."
      },
      {
        "language": "jp",
        "title": "Bottari",
        "detail": "これは、Playストアに3回目に公開したFlutterプロジェクトです。\n以前、匿名で自分の言いたいことを気軽に話せるアプリを使ったことがあり、そのアプリからインスピレーションを受けて開発しました。\n昔、祖母が話してくれた物語の思い出を込め、「ボッタリ（包み）」という名前を付け、誰もが語り手になれるプラットフォームを作りたいと考えました。\n現在、Playストアでダウンロードでき、ユーザーから積極的にフィードバックを受け取っています。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "bottari_1.png"
      }
    ]
  },
  {
    "no": 8,
    "projectCode": "bannermaker",
    "periodStart": "2022-07-13",
    "periodEnd": "2022-07-17",
    "skills": "Flutter",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "스플래툰 배너 제작기",
        "detail": "제가 좋아하는 TPS 게임인 닌텐도의 '스플래툰'이라는 게임이 있습니다.\n이 게임에서는 사용자마다 자신만의 배너를 꾸밀 수 있지만, 게임 내에서 얻은 배너 이미지로만 꾸밀 수 있어 원하는 디자인을 만들기 어려웠습니다.\n또한 원하는 배너를 아크릴 키링으로 제작하고 싶었기 때문에, 한글 지원, 커스텀 이미지, 배지 크기 조정 등의 기능을 포함한 간단한 플러터 웹 툴을 제작하여 배너를 커스터마이징하고 추출할 수 있게 했습니다."
      },
      {
        "language": "en",
        "title": "Splatoon Banner Creator",
        "detail": "There is a TPS game I love called 'Splatoon' by Nintendo.\nIn this game, each user can design their own banner, but customization is limited to images earned within the game, making it difficult to create a banner exactly as I wanted.\nTo make banners that could be used as acrylic keychains, I created a simple Flutter web tool that provides features such as Korean language support, custom images, badge resizing, and more, allowing users to customize and extract their desired banners."
      },
      {
        "language": "jp",
        "title": "スプラトゥーンバナー制作ツール",
        "detail": "私が好きなTPSゲームに任天堂の『スプラトゥーン』があります。\nこのゲームでは、各ユーザーが自分のバナーをカスタマイズできますが、ゲーム内で獲得したバナー画像しか使えないため、理想のデザインを作るのが難しいです。\n自分が望むバナーをアクリルキーホルダーとして制作するため、韓国語対応、カスタム画像、バッジサイズ調整などの機能を含む簡単なFlutter Webツールを制作し、カスタムバナーの生成と抽出を可能にしました。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "bannermaker_1.png"
      }
    ]
  },
  {
    "no": 9,
    "projectCode": "discordbot",
    "periodStart": "2022-10-05",
    "periodEnd": "2023-01-12",
    "skills": "Node.js, Sequelize, MySQL",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "권병덕",
        "detail": "여가 시간에 주로 친구들과 디스코드를 통해 활동합니다.\n디스코드에서는 각 서버에서 봇을 사용할 수 있는데, 기존 TTS 봇들이 자주 셧다운되거나 성능 저하 문제가 발생했습니다.\n또한, 자유롭게 음성을 선택할 수 없어 발표자를 구분하기 어려운 점이 있었습니다.\n이 기회에 그동안 갈고닦은 NodeJS 실력을 발휘해 봇을 구현하기 시작했으며, TTS 외에도 다양한 활동에 필요한 기능들을 추가했습니다.\n현재도 활발히 사용 중이며, 계속해서 개선 사항을 반영하고 있습니다. 참고로 '권병덕'은 독립운동가의 성함을 따서 만들었습니다."
      },
      {
        "language": "en",
        "title": "Discord Bot",
        "detail": "In my free time, I often interact with friends on Discord.\nWhile each server can utilize bots, existing TTS bots frequently faced shutdowns or performance issues.\nAdditionally, it was difficult to distinguish between speakers, as there was no option for flexible voice selection.\nI took this opportunity to apply my NodeJS skills and started developing my own bot, incorporating not only TTS but also various features to enhance our activities. The bot is actively used, and I am continuously implementing improvements."
      },
      {
        "language": "jp",
        "title": "Discord Bot",
        "detail": "余暇時間に主に友人とDiscordを通じて活動しています。\nDiscordでは各サーバーでボットを利用できますが、既存のTTSボットは頻繁にシャットダウンしたり、性能が低下する問題がありました。\nまた、自由な音声選択ができないため、発表者を区別するのが難しい点もありました。\nこの機会に、これまで磨いてきたNodeJSのスキルを活かしてボットの開発を開始し、TTSだけでなく活動に必要なさまざまな機能も追加しました。\n現在も活発に使用しており、改善点を継続して反映しています。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "discordbot_1.png"
      }
    ]
  },
  {
    "no": 10,
    "projectCode": "jwapi",
    "periodStart": "2023-04-05",
    "skills": "Node.js, Nest.js, MariaDB, SocketIO, PM2",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "개인 API",
        "detail": "여러 개인 프로젝트를 진행하다 보니 자잘한 기능들에 대해 서버 연동이 필요한 경우가 생겼습니다.\n이를 위해 개인용 API 서버를 구축하였고, 저의 모든 백엔드 기술을 결합하여 다양한 프로젝트에 연동하고 있습니다. (이 포트폴리오 웹사이트의 일부 기능도 포함)\n또한, 이 API 서버는 다양한 테스트를 위한 도화지 역할도 하고 있습니다."
      },
      {
        "language": "en",
        "title": "Personal API",
        "detail": "As I worked on various personal projects, I found the need for server integration for small functionalities.\nTo address this, I built a personal API server that incorporates all my backend skills, linking it with various projects, including some features on this portfolio website.\nAdditionally, this API server serves as a canvas for testing diverse experiments."
      },
      {
        "language": "jp",
        "title": "個人API",
        "detail": "さまざまな個人プロジェクトを進める中で、小さな機能にサーバー連携が必要になることがありました。\nそのため、個人用APIサーバーを構築し、自分のすべてのバックエンド技術を集約し、さまざまなプロジェクトに連携しています。（このポートフォリオウェブサイトの一部機能も含む）\nまた、このAPIサーバーはさまざまなテストのためのキャンバスの役割も果たしています。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "jwapi_1.png"
      }
    ]
  },
  {
    "no": 11,
    "projectCode": "recog",
    "periodStart": "2023-06-05",
    "periodEnd": "2023-11-04",
    "skills": "Flutter, Node.js, Nest.js, MariaDB",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "훈련 관리 시스템",
        "detail": "디지털 훈련과 관련된 프로젝트가 시작되었으나, 팀에 Back-Office 개발 인력이 부족하여 제가 직접 프로젝트를 맡게 되었습니다.\n5개월 내에 완료해야 하는 프로젝트였기에 빠르게 진행해야 했고, 주력 기술인 Flutter를 활용하여 Native Web 기술 없이도 무리 없이 Web 구현을 할 수 있다고 판단하여 개발을 진행했습니다.\nAPI 서버와 연동하여 모의고사 형식의 응시, 사용자 관리, 권한 관리, 결제 모듈, 라이선스 관리 등의 기능을 제공하게 되었습니다."
      },
      {
        "language": "en",
        "title": "Training Management System",
        "detail": "A project related to digital training began, but due to a shortage of Back-Office development resources in the team, I took on the project myself.\nWith only three months to complete it, rapid progress was essential. I determined that using my primary skill, Flutter, would allow for efficient web implementation without Native Web technology.\nThe system integrates with an API server and provides features such as mock exam participation, user management, permission control, payment module, and license management."
      },
      {
        "language": "jp",
        "title": "トレーニング管理システム",
        "detail": "デジタルトレーニングに関連するプロジェクトが始まりましたが、チーム内でBack-Officeを開発する人材が不足していたため、私が直接プロジェクトを担当することになりました。\n3ヶ月以内に完了する必要があり、迅速な進行が求められましたが、私の主力技術であるFlutterを使えば、Native Web技術なしでも問題なくWeb実装が可能であると判断し、開発を進めました。\nAPIサーバーと連携し、模擬試験形式の受験、ユーザー管理、権限管理、決済モジュール、ライセンス管理などの機能を提供しています。"
      }
    ],
    "attachments": [
      {
        "originalFilename": "recog_1.png"
      }
    ]
  },
  {
    "no": 12,
    "projectCode": "zioyouemailcrawler",
    "periodStart": "2024-02-05",
    "periodEnd": "2024-02-12",
    "skills": "Flutter, Node.js, Nest.js",
    "isHide": false,
    "details": [
      {
        "language": "kr",
        "title": "이메일 백업기",
        "detail": "회사 내에서 기존에 사용하던 'Zioyou'라는 그룹웨어를 변경하게 되었는데, 그룹웨어에 있는 400만 통의 사내 메일을 백업해야 했습니다.\n무조건 자동화 방법을 찾아야 했고, 그룹웨어의 모든 이벤트를 크롬 WebInspector로 조사하던 중 모바일 API로 데이터를 추출할 수 있다는 것을 알게 되었습니다.\n약 7일간 백업 작업을 진행했으며, 첨부 파일은 별도로 구축한 이메일 첨부 파일 서버에 저장하고, 백업된 EML 파일에 다운로드 링크를 추가해 프로젝트를 성공적으로 마무리할 수 있었습니다."
      },
      {
        "language": "en",
        "title": "Email Backup Tool",
        "detail": "Our company decided to switch from the existing groupware, 'Zioyou,' and needed to back up 4,000,000 internal emails.\nI needed to find a way to automate this process, and after investigating all groupware events using Chrome WebInspector, I discovered that I could extract data via the mobile API.\nThe backup took about 7 days, during which I stored attachments on a separate email attachment server and added download links in the backed-up EML files, successfully completing the project."
      },
      {
        "language": "jp",
        "title": "メールバックアップツール",
        "detail": "社内で使用していた『Zioyou』というグループウェアを変更することになり、グループウェア上の400万通の社内メールをバックアップする必要がありました。\nそこで自動化方法を探すことになり、Chrome WebInspectorでグループウェアイベントを調査していると、モバイルAPIでデータを抽出できることがわかりました。\n約7日間バックアップ作業を行い、添付ファイルは別途構築したメール添付ファイルサーバーに保存し、バックアップされたEMLファイルにダウンロードリンクを追加してプロジェクトを無事に完了することができました。"
      }

    ],
    "attachments": [
      {
        "originalFilename": "zioyou_email_crawler_1.png"
      }
    ]
  }
]