{
  "kr": {
    "flutter": "부드러운 UI와 애니메이션을 제공하는 최고의 크로스플랫폼 프레임워크입니다.\n원코드 기반으로 다양한 플랫폼에서 앱을 만들 수 있으며,\n제가 가장 자신 있는 기술입니다. 여러 프로젝트를 통해 깊은 경험을 쌓았고, Flutter의 모든 기능을 능숙하게 활용할 수 있습니다.",
    "nodejs": "백지에서 시작해 레고 블록처럼 시스템을 구축하는 재미를 선사하는 기술입니다.\n그러한 매력에 빠진 뒤로 NodeJS를 통해 알고리즘 테스트나 토이 프로젝트 같은 간단한 작업을 자주 해왔고, Express.js와 결합해 자유롭고 유연한 시스템을 구축하는 것을 즐기고 있습니다.",
    "mariadb": "개발자에게 데이터베이스는 필수죠.\n소셜 미디어, 블로그, 쇼핑몰, 다이어리, 시험 등 다양한 웹 플랫폼에서 데이터베이스를 구축한 경험이 있고, 가장 효율적인 쿼리문을 찾는데에 투자를 아끼지 않습니다.",
    "nestjs": "중대형 프로젝트에서 주로 Backend API 구현을 위해 사용하는 기술입니다.\nNode.js와 Express.js를 이용한 API 개발을 통해 큰 즐거움을 느꼈지만, 유지보수의 중요성을 깨달은 후로는 NestJS의 필요성을 이해하게 되었습니다. 그 이후 대부분의 프로젝트에서 NestJS를 활용하고 있습니다.",
    "dotnet": "처음 프로그래밍에 입문할 때 배운 언어가 C#입니다.\n주력 언어만큼 사용하진 않았지만, 객체지향 패러다임을 이해하는 데 큰 도움이 되었습니다.\n닷넷 프레임워크 중 WinForm과 ASP.NET Core를 사용하여 앱을 제작한 경험이 있습니다.",
    "linux": "(저에게는)세상에서 가장 귀여운 펭귄,\n리눅스 서버는 제가 어딜 가든 마치 항상 옆에 있는 단짝과 같은 친구입니다.\n기본적인 명령어를 사용해 웹서버를 자유롭게 구성할 수 있으며, 쉘 스크립트를 활용해 자동화 시스템을 구축한 경험도 있습니다.",
    "androidstudio": "Flutter 개발 시 주로 사용하는 IDE입니다.\n처음 안드로이드 앱 개발을 시작할 때부터 사용해 왔고, 프로그램이 다소 무겁긴 하지만 저의 개발 속도를 빠르게 해주는 유용한 도구입니다.",
    "nginx": "서버 호스팅 및 WebAPI 프록시 호스팅에 탁월한 기술입니다.\nNginx를 통해 가상 호스트 및 다양한 서버 환경을 구축해 본 경험이 있습니다.\n현재 제가 호스팅중인 이 웹사이트나 Code-Server 또는 기타 프로젝트들 모두 Nginx로 관리중입니다.",
    "vscode": "개인화된 Code-Server를 구축해 아이패드에서도 메인으로 사용할 정도로 좋아하는 IDE입니다.\n가벼운 무게와 자유로운 커스터마이징의 매력에 빠져버려 필요한 익스텐션까지도 직접 개발해 사용해보기도 했습니다.",
    "socketio": "WebAPI 개발에 익숙해질 무렵, 실시간 통신의 매력을 알게 되었습니다.\n동적인 서비스 구현을 위해서는 필수요소라 생각을 하여 WebSocket으로 입문하여, 편의성과 유지보수 측면에서 뛰어난 SocketIO를 공부했습니다.\n이후 Flutter와 결합해 실시간 게임, 채팅앱 등의 프로젝트를 진행한 경험이 있습니다.",
    "github": "처음엔 단순한 클라우드 저장소로만 생각했지만, 형상 관리의 중요성을 깨닫고 나서부터는 Git과 GitHub을 애용하고 있습니다.\n이를 통해 협업 및 프로젝트 관리 경험도 풍부해졌고,\n지금 이 웹사이트를 호스팅중인 서버에 마저 Github Action을 활용하여 배포 자동화의 이점을 누리고 있습니다."
  },
  "en": {
    "flutter": "Flutter is the best cross-platform framework providing smooth UI and animations.\nWith a single codebase, you can build apps for various platforms, and it's the technology I'm most confident in.\nI have gained deep experience through multiple projects and can proficiently utilize all of Flutter's features.",
    "nodejs": "Node.js is a technology that allows me to build systems from scratch like assembling Lego blocks.\nAfter being drawn to its charm, I've often used Node.js for algorithm testing or toy projects,\nand I enjoy combining it with Express.js to create flexible and dynamic systems.",
    "mariadb": "Databases are essential for developers.\nI have experience building databases for various web platforms such as social media, blogs, shopping malls, diaries, and exams,\nand I always invest time in finding the most efficient queries.",
    "nestjs": "I primarily use NestJS for backend API development in medium to large-scale projects.\nWhile I enjoyed building APIs using Node.js and Express.js, I soon realized the importance of maintainability.\nSince then, I’ve come to rely on NestJS for most of my projects.",
    "dotnet": "C# was the first programming language I learned when I started my journey into development.\nAlthough I don’t use it as frequently as my main languages, it helped me grasp object-oriented paradigms.\nI have experience developing apps using the .NET framework, particularly with WinForm and ASP.NET Core.",
    "linux": "Linux, the cutest penguin in the world (to me),\nfeels like a trusty companion that's always by my side wherever I go.\nI’m proficient in setting up web servers using basic commands and have built automated systems with shell scripts.",
    "androidstudio": "Android Studio is the IDE I mainly use when developing with Flutter.\nI’ve used it since I first started Android app development,\nand although it can be a bit heavy, it's a powerful tool that significantly speeds up my development process.",
    "nginx": "Nginx is a reliable technology for server hosting and WebAPI proxy hosting.\nI’ve used Nginx to set up virtual hosts and manage various server environments.\nIn fact, I manage this website, my Code-Server, and other projects all through Nginx.",
    "vscode": "I love Visual Studio Code so much that I've even set up a customized Code-Server to use it on my iPad as my main IDE.\nI was drawn to its lightweight nature and flexibility, and I’ve even developed custom extensions to add features I needed.",
    "socketio": "As I became more familiar with WebAPI development, I discovered the appeal of real-time communication.\nI started with WebSocket for implementing dynamic services, then moved to Socket.IO for its convenience and maintainability.\nSince then, I’ve used it with Flutter to create real-time games and chat apps.",
    "github": "At first, I thought GitHub was just a simple cloud storage, but after realizing the importance of version control, I became a frequent user of Git and GitHub.\nThrough this, I have gained extensive experience in collaboration and project management,\nand I am now taking advantage of deployment automation using GitHub Actions on the server hosting this website."
  },
  "jp": {
    "flutter": "Flutterは、滑らかなUIとアニメーションを提供する最高のクロスプラットフォームフレームワークです。\n1つのコードベースでさまざまなプラットフォーム向けのアプリを作成でき、最も自信のある技術です。\n複数のプロジェクトを通じて深い経験を積み、Flutterのすべての機能を巧みに活用できます。",
    "nodejs": "Node.jsは、レゴブロックを組み立てるように、ゼロからシステムを構築することができる技術です。\nその魅力に惹かれ、アルゴリズムテストやトイプロジェクトなどでNode.jsを頻繁に使用してきました。\nExpress.jsと組み合わせて、柔軟で動的なシステムを作成することを楽しんでいます。",
    "mariadb": "データベースは開発者にとって必須の技術です。\nソーシャルメディア、ブログ、ショッピングモール、ダイアリー、試験など、さまざまなウェブプラットフォームのデータベースを構築した経験があります。\n最も効率的なクエリを見つけるために時間を惜しまず投資しています。",
    "nestjs": "中規模から大規模なプロジェクトで、主にバックエンドAPIの実装にNestJSを使用します。\nNode.jsとExpress.jsを使ってAPIを開発するのが楽しかったですが、メンテナンスの重要性に気づいた後、NestJSの必要性を理解しました。\nその後はほとんどのプロジェクトでNestJSを使用しています。",
    "dotnet": "C#は私がプログラミングを始めたときに最初に学んだ言語です。\nメインの言語ほど頻繁には使いませんが、オブジェクト指向パラダイムを理解するのに大いに役立ちました。\nWinFormやASP.NET Coreを使ってアプリを作成した経験があります。",
    "linux": "（私にとって）世界で最もかわいいペンギン、\nLinuxサーバーはどこに行っても常にそばにいる頼れる仲間のような存在です。\n基本的なコマンドを使ってウェブサーバーを自由に構築でき、シェルスクリプトを使用して自動化システムを構築した経験もあります。",
    "androidstudio": "Android StudioはFlutter開発の際に主に使用しているIDEです。\nAndroidアプリの開発を始めたときから使用しており、少し重いですが、開発速度を大幅に向上させる便利なツールです。",
    "nginx": "Nginxは、サーバーホスティングやWebAPIプロキシホスティングに非常に優れた技術です。\nNginxを使って、仮想ホストやさまざまなサーバー環境を構築した経験があります。\n現在、私がホスティングしているこのウェブサイトやCode-Server、その他のプロジェクトもすべてNginxで管理しています。",
    "vscode": "iPadでもメインのIDEとして使えるように、カスタマイズしたCode-Serverを構築するほどVS Codeが大好きです。\n軽量で自由にカスタマイズできる魅力に惹かれ、必要な機能を追加するために独自の拡張機能を開発したこともあります。",
    "socketio": "WebAPI開発に慣れてきたころ、リアルタイム通信の魅力に気づきました。\n動的なサービスの実装には不可欠だと考え、WebSocketから始めましたが、利便性とメンテナンス性の観点から優れたSocket.IOを学びました。\nその後、Flutterと組み合わせてリアルタイムゲームやチャットアプリなどのプロジェクトを進めた経験があります。",
    "github": "最初はGitHubを単なるクラウドストレージだと思っていましたが、バージョン管理の重要性に気づいてからはGitとGitHubを頻繁に使うようになりました。\nこれにより、コラボレーションやプロジェクト管理における豊富な経験を得ることができ、\n現在、このウェブサイトをホスティングしているサーバーでは、GitHub Actionsを活用してデプロイ自動化の利点を享受しています。"
  },
  "unknown": {
    "flutter": "",
    "nodejs": "",
    "mariadb": "",
    "nestjs": "",
    "dotnet": "",
    "linux": "",
    "androidstudio": "",
    "nginx": "",
    "vscode": "",
    "socketio": "",
    "github": ""
  }
}